loadtest/rest.yml
config:
  target: "${BASE_URL}"          # e.g. https://<LB-IP-or-DNS>:9091
  phases:
    # Warm-up to stabilize JIT/containers
    - duration: 120
      arrivalRate: 2
      name: warmup
    # Ramp-up to trigger HPA
    - duration: 300
      arrivalRate: 10
      rampTo: 50
      name: ramp_to_50_rps
    # Sustained peak to scale pods (and maybe nodes)
    - duration: 600
      arrivalRate: 50
      name: peak
  tls:
    # If hitting raw LB IP with a non-public cert, set false
    rejectUnauthorized: true
  engines:
    http:
      connections: 200
  processor: "./processors.js"
  defaults:
    headers:
      Content-Type: application/json

scenarios:
  - name: results-mix-and-pdf
    flow:
      # Global randomization per VU (see processors.js)
      - function: seedRandoms

      # 1) Lightweight health (availability)
      - get:
          url: "/actuator/health"
        expect:
          - statusCode: 200
      - think: 0.2

      # 2) List paged results
      - get:
          url: "/api/results?page={{ page }}&size=20&sortBy=id"
        expect:
          - statusCode: 200
      - think: 0.3

      # 3) By athlete (athleteId is String in your controller)
      - get:
          url: "/api/results/athlete/{{ athleteId }}?page=0&size=10&sortBy=id"
        expect:
          - statusCode: 200
      - think: 0.3

      # 4) By event (eventId is Long)
      - get:
          url: "/api/results/event/{{ eventId }}?page=0&size=10&sortBy=id"
        expect:
          - statusCode: 200
      - think: 0.4

      # 5) Trigger PDF generation (202 Accepted expected)
      - post:
          url: "/api/results/pdf/{{ athleteId }}"
        expect:
          - statusCode: 202

      # Small pause to simulate a human
      - think: 1