loadtest/ws-stomp.yml
config:
  target: "${WS_URL}"   # wss://<LB-IP-or-DNS>:9091/ws/websocket  (SockJS)  o .../ws (nativo)
  phases:
    - duration: 120
      arrivalRate: 2
      name: warmup
    - duration: 300
      arrivalRate: 10
      rampTo: 40
      name: ramp_ws
    - duration: 600
      arrivalRate: 40
      name: peak_ws
  engines:
    ws: {}
  processor: "./ws_stomp.js"

scenarios:
  - name: ws-stomp-subscribe
    engine: "ws"
    flow:
      - connect
      - function: stompConnect
      - function: stompSubscribeResults
      # opcional: enviar a tu app si tienes un destino /app/...
      # - function: stompSendApp
      - think: 10
      - function: stompDisconnect
      - disconnect